In [1]:
import pandas as pd

credit_history = pd.read_parquet('data/credit_history.parquet')
credit_history.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89999 entries, 0 to 89998
Data columns (total 12 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer_number            89999 non-null  int64
 1   credit_score               89999 non-null  int64
 2   num_credit_accounts        89999 non-null  int64
 3   oldest_credit_line_age     89999 non-null  float64
 4   oldest_account_age_months  89999 non-null  float64
 5   total_credit_limit         89999 non-null  float64
 6   num_delinquencies_2yrs     89167 non-null  float64
 7   num_inquiries_6mo          89999 non-null  int64
 8   recent_inquiry_count       89999 non-null  int64
 9   num_public_records         89999 non-null  int64
 10  num_collections            89999 non-null  int64
 11  account_diversity_index    89999 non-null  float64
dtypes: float64(5), int64(7)
memory usage: 8.2 MB

In [2]:
credit_history.head()

,customer_number,credit_score,num_credit_accounts,oldest_credit_line_age,oldest_account_age_months,total_credit_limit,num_delinquencies_2yrs,num_inquiries_6mo,recent_inquiry_count,num_public_records,num_collections,account_diversity_index
0,10000,696,14,22.8,273.6,169100.0,0.0,2,2,1,0,0.499
1,10001,659,13,3.5,42.0,78200.0,0.0,6,6,0,0,0.298
2,10002,662,3,0.0,0.0,41400.0,0.0,2,2,0,0,0.174
3,10003,676,8,9.0,108.0,60000.0,0.0,1,1,0,0,0.263
4,10004,678,7,8.0,96.0,49700.0,0.0,1,1,0,0,0.298

In [57]:
xml = pd.read_xml('data/geographic_data.xml')
xml.to_csv('data/sending/geographic.csv')

In [4]:
xml.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89999 entries, 0 to 89998
Data columns (total 8 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   id                          89999 non-null  int64
 1   state                       89999 non-null  object
 2   regional_unemployment_rate  89999 non-null  float64
 3   regional_median_income      89999 non-null  int64
 4   regional_median_rent        89999 non-null  float64
 5   housing_price_index         89999 non-null  float64
 6   cost_of_living_index        89999 non-null  float64
 7   previous_zip_code           89999 non-null  int64
dtypes: float64(4), int64(3), object(1)
memory usage: 5.5+ MB

## Loan Details

In [5]:
loan_detail_df = pd.read_csv('data/loan_details.csv')
loan_detail_df.loan_type.unique()

array(['Personal', 'mortgage', 'Personal Loan', 'PERSONAL', 'CreditCard',
       'Credit Card', 'Mortgage', 'Home Loan', 'MORTGAGE', 'CC',
       'credit card', 'personal'], dtype=object)

In [6]:
loan_detail_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89999 entries, 0 to 89998
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   customer_id          89999 non-null  int64
 1   loan_type            89999 non-null  object
 2   loan_amount          89999 non-null  object
 3   loan_term            89999 non-null  int64
 4   interest_rate        89999 non-null  float64
 5   loan_purpose         89999 non-null  object
 6   loan_to_value_ratio  89999 non-null  float64
 7   origination_channel  89999 non-null  object
 8   loan_officer_id      89999 non-null  int64
 9   marketing_campaign   89999 non-null  object
dtypes: float64(2), int64(3), object(5)
memory usage: 6.9+ MB

In [8]:
def loan_type_conversion(df):
    mapping = {
        'personal': 'personal',
        'personal loan': 'personal',
        'personalloan': 'personal',

        'creditcard': 'credit_card',
        'credit card': 'credit_card',
        'cc': 'credit_card',

        'mortgage': 'mortgage',

        'home loan': 'home',
        'homeloan': 'home',
        'home': 'home'
    }

    cleaned = []

    for value in df['loan_type']:
        key = str(value).strip().lower()
        key = key.replace("_", "").replace("-", " ").replace("  ", " ")

        cleaned.append(mapping.get(key, 'other'))

    df['loan_type'] = cleaned 
    return df

loan_detail_df = loan_type_conversion(loan_detail_df)

In [9]:
loan_detail_df.loan_type.unique()

array(['personal', 'mortgage', 'credit_card', 'home'], dtype=object)

In [10]:
def loan_amount_to_int(df):
    df['loan_amount'] = (
        df['loan_amount']
        .astype(str)
        .str.replace(r'[\$,]', '', regex=True)
        .str.strip()
        .pipe(pd.to_numeric, errors='coerce')
        .astype("Int64")  
    )
    return df

loan_detail_df = loan_amount_to_int(loan_detail_df)
loan_detail_df = loan_detail_df.rename(columns={
    'loan_amount': 'loan_amount ($)'
})
loan_detail_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89999 entries, 0 to 89998
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   customer_id          89999 non-null  int64
 1   loan_type            89999 non-null  object
 2   loan_amount ($)      89999 non-null  Int64
 3   loan_term            89999 non-null  int64
 4   interest_rate        89999 non-null  float64
 5   loan_purpose         89999 non-null  object
 6   loan_to_value_ratio  89999 non-null  float64
 7   origination_channel  89999 non-null  object
 8   loan_officer_id      89999 non-null  int64
 9   marketing_campaign   89999 non-null  object
dtypes: Int64(1), float64(2), int64(3), object(4)
memory usage: 7.0+ MB

In [11]:
loan_detail_df['loan_amount ($)'].sample(10)

16370     23500
14550    266600
46242     13800
46649    355500
50934     26700
31887     14800
44385      8800
1618     408200
13456     22400
24704     14500
Name: loan_amount ($), dtype: Int64

In [12]:
loan_detail_df.origination_channel.unique()

array(['Direct Mail', 'Branch', 'Online', 'Broker'], dtype=object)

In [13]:
loan_detail_df.loan_purpose.unique()

array(['Debt Consolidation', 'Refinance', 'Major Purchase', 'Medical',
       'Revolving Credit', 'Home Improvement', 'Home Purchase', 'Other'],
      dtype=object)

In [14]:
loan_detail_df.to_csv('data/loan_details_cleaned.csv', index=False)

## Demographics

In [39]:
demographic_df = pd.read_csv('data/demographics (1) (2).csv')

demographic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89999 entries, 0 to 89998
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   cust_id            89999 non-null  int64
 1   age                89999 non-null  int64
 2   annual_income      89999 non-null  object
 3   employment_length  87746 non-null  float64
 4   employment_type    89999 non-null  object
 5   education          89999 non-null  object
 6   marital_status     89999 non-null  object
 7   num_dependents     89999 non-null  int64
dtypes: float64(1), int64(3), object(4)
memory usage: 5.5+ MB

In [40]:
def annual_amount_to_int(df):
    df['annual_income'] = (
        df['annual_income']
        .astype(str)
        .str.replace(r'[\$,]', '', regex=True)
        .str.strip()
        .pipe(pd.to_numeric, errors='coerce')
        .astype("Int64")  
    )
    return df

demographic_df = annual_amount_to_int(demographic_df)

In [41]:
demographic_df.employment_type.unique()

array(['Full-time', 'FULL_TIME', 'Full Time', 'Fulltime', 'Part Time',
       'Self Employed', 'FT', 'Self Emp', 'Contractor', 'Self-employed',
       'SELF_EMPLOYED', 'Contract', 'PART_TIME', 'CONTRACT', 'PT',
       'Part-time'], dtype=object)

In [42]:
def clean_demographics(df):

    # ---- 1. Rename columns ----
    df = df.rename(columns={
        'cust_id': 'customer_id',
        'annual_income': 'annual_income ($)'
    })

    # ---- 2. Clean annual income ----
    df['annual_income ($)'] = (
        df['annual_income ($)']
        .astype(str)
        .str.replace(r'[\$,]', '', regex=True)
        .str.strip()
        .pipe(pd.to_numeric, errors='coerce')
        .astype("Int64")
    )

    # ---- 3. Employment type mapping ----
    mapping = {
        'full-time': 'full_time',
        'full time': 'full_time',
        'fulltime': 'full_time',
        'ft': 'full_time',
        'full_time': 'full_time',

        'part-time': 'part_time',
        'part time': 'part_time',
        'parttime': 'part_time',
        'pt': 'part_time',
        'part_time': 'part_time',

        'contractor': 'contract',
        'contract': 'contract',
        'contractor ': 'contract',

        'self employed': 'self_employed',
        'self-employed': 'self_employed',
        'self employed ': 'self_employed',
        'selfemp': 'self_employed',
        'self emp': 'self_employed',
        'self_employed': 'self_employed'
    }

    cleaned_employment = []
    for value in df['employment_type']:
        key = (
            str(value)
            .strip()
            .lower()
            .replace("_", " ")
            .replace("-", " ")
        )
        key = " ".join(key.split())
        cleaned_employment.append(mapping.get(key, 'other'))

    df['employment_type'] = cleaned_employment

    return df


demographic_df = clean_demographics(demographic_df)

demographic_df.to_csv('data/sending/demographic_cleaned.csv', index=False)

In [44]:
demographic_df.isna().sum()

customer_id             0
age                     0
annual_income ($)       0
employment_length    2253
employment_type         0
education               0
marital_status          0
num_dependents          0
dtype: int64

In [47]:
demographic_df['employment_length'] = demographic_df['employment_length'].fillna(
    demographic_df.groupby('employment_type')['employment_length'].transform('median')
)

demographic_df.head(10)

,customer_id,age,annual_income ($),employment_length,employment_type,education,marital_status,num_dependents
0,10000,41,61800,2.2,full_time,Graduate,Married,2
1,10001,38,28600,7.0,full_time,High School,Married,0
2,10002,18,20700,0.8,full_time,Bachelor,Single,0
3,10003,27,31400,4.8,full_time,Bachelor,Single,0
4,10004,26,24600,5.2,full_time,High School,Single,0
5,10005,22,56100,4.7,full_time,Graduate,Married,0
6,10006,32,37100,3.7,full_time,High School,Married,0
7,10007,42,34600,1.7,full_time,High School,Married,2
8,10008,52,26200,5.2,full_time,Some College,Married,2
9,10009,45,60100,10.9,part_time,High School,Married,0

## Financial DF

In [51]:
import pandas as pd

financial_df = pd.read_json('data/financial_ratios.jsonl', lines=True)

financial_df.head()

,cust_num,monthly_income,existing_monthly_debt,monthly_payment,debt_to_income_ratio,debt_service_ratio,payment_to_income_ratio,credit_utilization,revolving_balance,credit_usage_amount,available_credit,total_monthly_debt_payment,annual_debt_payment,loan_to_annual_income,total_debt_amount,monthly_free_cash_flow
0,10000,"5,150.00",738.64,$592.13,0.258,0.258402,0.115,0.841,"$142,213.10","$142,213.10","$26,886.90",1330.77,15969.24,0.286408,"159,913.10","3,819.23"
1,10001,"2,383.33",392.21,"1,013.86",0.590,0.589959,0.425,0.971,"$75,932.20","75,932.20","$2,267.80",1406.07,16872.84,3.986014,"189,932.20",$977.26
2,10002,"1,725.00",204.07,$317.81,0.303,0.302539,0.184,0.539,22314.6,"22,314.60","$19,085.40",521.88,6262.56,0.449275,31614.6,1203.12
3,10003,"2,616.67",$288.71,234.52,0.200,0.199961,0.090,0.147,"8,820.00",8820.0,"51,180.00",523.23,6278.76,0.277070,"$17,520.00",2093.4366666666665
4,10004,"2,050.00",$248.77,334.81,0.285,0.284673,0.163,0.488,24253.6,24253.6,"25,446.40",583.58,7002.96,0.292683,"$31,453.60",1466.42

In [52]:
categorical_cols = financial_df.select_dtypes(include='object').columns
categorical_cols

Index(['monthly_income', 'existing_monthly_debt', 'monthly_payment',
       'revolving_balance', 'credit_usage_amount', 'available_credit',
       'total_monthly_debt_payment', 'total_debt_amount',
       'monthly_free_cash_flow'],
      dtype='object')

In [55]:
def clean_financial_cols(df, cols):
    for col in cols:
        df[col] = (
            df[col]
            .astype(str)  # make sure everything is string
            .str.replace(r'[\$,]', '', regex=True)  # remove $ and ,
            .str.strip()  # remove leading/trailing spaces
            .replace('', pd.NA)  # empty strings to NA
            .pipe(pd.to_numeric, errors='coerce')  # convert to numeric
        )
    return df

categorical_cols = [
    'monthly_income', 'existing_monthly_debt', 'monthly_payment',
    'revolving_balance', 'credit_usage_amount', 'available_credit',
    'total_monthly_debt_payment', 'total_debt_amount', 'monthly_free_cash_flow'
]

financial_df.rename({'cust_num': 'customer_id'}, inplace=True)

financial_df = clean_financial_cols(financial_df, categorical_cols)
financial_df.head()
financial_df.shape

(89999, 16)

In [56]:
financial_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89999 entries, 0 to 89998
Data columns (total 16 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   cust_num                    89999 non-null  int64
 1   monthly_income              89999 non-null  float64
 2   existing_monthly_debt       89999 non-null  float64
 3   monthly_payment             89999 non-null  float64
 4   debt_to_income_ratio        89999 non-null  float64
 5   debt_service_ratio          89999 non-null  float64
 6   payment_to_income_ratio     89999 non-null  float64
 7   credit_utilization          89999 non-null  float64
 8   revolving_balance           88622 non-null  float64
 9   credit_usage_amount         89999 non-null  float64
 10  available_credit            89999 non-null  float64
 11  total_monthly_debt_payment  89999 non-null  float64
 12  annual_debt_payment         89999 non-null  float64
 13  loan_to_annual_income       89999 non-null  float64
 14  total_debt_amount           89999 non-null  float64
 15  monthly_free_cash_flow      89999 non-null  float64
dtypes: float64(15), int64(1)
memory usage: 11.0 MB